// - створити функцію, яка якщо приймає один аргумент, просто вивдоить його, якщо два аргументи - складає або конкатенує їх між собою.




// - створити функцію  яка приймає два масиви та скаладає значення елементів з однаковими індексами  та повертає новий результуючий масив.
//     EXAMPLE:
// [1,2,3,4]
//     [2,3,4,5]
// результат
//     [3,5,7,9]

//
// let arr1=[2,2,3,4,5];
// let arr2=[5,4,3,2,3];

// function adding(arr1,arr2){
//     let sum=[];
//     for (let i = 0, ri=0; i < arr1.length,ri<arr2.length; i++, ri++) {
//         sum=arr1[i]+arr2[ri];
//     }
//     return sum;
// }
// console.log(adding([1,2,3,4,5],[5,4,3,2,1]));

// - Створити функцію яка приймає масив будь яких объектів, та повертає масив ключів всіх обєктів
// EXAMPLE:
//     [{name: 'Dima', age: 13}, {model: 'Camry'}]  ===> [ name, age, model ]

//
// let arr=[{name: 'Dima', age: 13}, {model: 'Camry'}];
// function obj(arr){
//     for (const item of arr){
//         console.log(item);
//     }
// }
// obj(arr);