// --створити масив з:
//     - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль

    // let number= [5,18,56,4,8];
    // let sring= ['wood','fish','mirror','eclipse','tupe'];
    // let diffrent= [false,'Ivan',75,true,3]
    // console.log(number,sring,diffrent);

// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль


   // let empty = [];
   //  empty[0]=1;
   //  empty[1]="andriy";
   //  empty[2]=true;
   //  empty[3]=45;
   //  empty[4]='volvo';
   //  console.log(empty);

// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.


 for (let i=0; i<10; i++){
  document.write('<div>item</div>');
 }
for (let i=0; i<10; i++){
 document.write(`<div>item ${i}</div>`);
}


while (i<20){
 document.write()
}


